{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 120, 160, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "pred_net_1", "class_name": "PredNet", "config": {"name": "pred_net_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "stack_sizes": [3, 32, 64, 128], "R_stack_sizes": [32, 64, 128, 256], "A_filt_sizes": [3, 3, 3], "Ahat_filt_sizes": [3, 3, 3, 3], "R_filt_sizes": [3, 3, 3, 3], "pixel_max": 1.0, "error_activation": "relu", "A_activation": "relu", "LSTM_activation": "relu", "LSTM_inner_activation": "hard_sigmoid", "data_format": "channels_last", "extrap_start_time": null, "output_mode": "segmentation"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxQAAAB8AGQAZACFAmQBZACFAmYCGQBTACkCTukBAAAAqQAp\nAdoBeHICAAAAcgIAAAD6WS9ob21lL2licmFoaW0vUHljaGFybVByb2plY3RzL2ZpcnN0X3BhcGVy\nL3JsX3NlZ21lbnRhdGlvbi90cmFpbmluZ19zY3JpcHRfc2VnbWVudGF0aW9uLnB52gg8bGFtYmRh\nPm8AAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["pred_net_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["lambda_1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}